{
    "modelTopology": {
        "training_config": {
            "loss_weights": null,
            "sample_weight_mode": null,
            "loss": "binary_crossentropy",
            "optimizer_config": {
                "config": {
                    "lr": 0.0010000000474974513,
                    "decay": 0.0,
                    "rho": 0.8999999761581421,
                    "epsilon": 1e-08
                },
                "class_name": "RMSprop"
            },
            "metrics": ["acc"]
        },
        "model_config": {
            "config": [{
                "config": {
                    "bias_regularizer": null,
                    "units": 32,
                    "activation": "relu",
                    "use_bias": true,
                    "kernel_initializer": {
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        },
                        "class_name": "VarianceScaling"
                    },
                    "activity_regularizer": null,
                    "trainable": true,
                    "kernel_constraint": null,
                    "bias_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "name": "dEnse3",
                    "batch_input_shape": [null, 10000],
                    "dtype": "float32",
                    "kernel_regularizer": null,
                    "bias_constraint": null
                },
                "class_name": "Dense"
            }, {
                "config": {
                    "bias_regularizer": null,
                    "units": 1,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "config": {
                            "scale": 1.0,
                            "distribution": "uniform",
                            "seed": null,
                            "mode": "fan_avg"
                        },
                        "class_name": "VarianceScaling"
                    },
                    "activity_regularizer": null,
                    "trainable": true,
                    "kernel_constraint": null,
                    "bias_initializer": {
                        "config": {},
                        "class_name": "Zeros"
                    },
                    "name": "dEnse4",
                    "bias_constraint": null,
                    "kernel_regularizer": null
                },
                "class_name": "Dense"
            }],
            "class_name": "Sequential"
        },
        "keras_version": "2.1.6",
        "backend": "tensorflow"
    },
    "weightsManifest": [{
        "paths": ["group1-shard1of1"],
        "weights": [{
            "name": "dEnse3/kernel",
            "shape": [10000, 32],
            "dtype": "float32"
        }, {
            "name": "dEnse3/bias",
            "shape": [32],
            "dtype": "float32"
        }]
    }, {
        "paths": ["group2-shard1of1"],
        "weights": [{
            "name": "dEnse4/kernel",
            "shape": [32, 1],
            "dtype": "float32"
        }, {
            "name": "dEnse4/bias",
            "shape": [1],
            "dtype": "float32"
        }]
    }]
}