{"weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"shape": [128], "name": "batch_normalization_1/gamma", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/beta", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "batch_normalization_1/moving_variance", "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"shape": [256], "name": "batch_normalization_2/gamma", "dtype": "float32"}, {"shape": [256], "name": "batch_normalization_2/beta", "dtype": "float32"}, {"shape": [256], "name": "batch_normalization_2/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "batch_normalization_2/moving_variance", "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"shape": [728], "name": "batch_normalization_3/gamma", "dtype": "float32"}, {"shape": [728], "name": "batch_normalization_3/beta", "dtype": "float32"}, {"shape": [728], "name": "batch_normalization_3/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "batch_normalization_3/moving_variance", "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"shape": [1024], "name": "batch_normalization_4/gamma", "dtype": "float32"}, {"shape": [1024], "name": "batch_normalization_4/beta", "dtype": "float32"}, {"shape": [1024], "name": "batch_normalization_4/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "batch_normalization_4/moving_variance", "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block10_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block10_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"shape": [728], "name": "block10_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block10_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block10_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"shape": [728], "name": "block10_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block10_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block10_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"shape": [728], "name": "block10_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block10_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block11_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block11_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"shape": [728], "name": "block11_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block11_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block11_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"shape": [728], "name": "block11_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block11_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block11_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"shape": [728], "name": "block11_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block11_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block12_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block12_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"shape": [728], "name": "block12_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block12_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block12_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group20-shard1of1"], "weights": [{"shape": [728], "name": "block12_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group21-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block12_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block12_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group22-shard1of1"], "weights": [{"shape": [728], "name": "block12_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block12_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group23-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block13_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block13_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group24-shard1of1"], "weights": [{"shape": [728], "name": "block13_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block13_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block13_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block13_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group25-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block13_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 1024], "name": "block13_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group26-shard1of1"], "weights": [{"shape": [1024], "name": "block13_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [1024], "name": "block13_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [1024], "name": "block13_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [1024], "name": "block13_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group27-shard1of2", "group27-shard2of2"], "weights": [{"shape": [3, 3, 1024, 1], "name": "block14_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 1024, 1536], "name": "block14_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group28-shard1of1"], "weights": [{"shape": [1536], "name": "block14_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [1536], "name": "block14_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [1536], "name": "block14_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [1536], "name": "block14_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group29-shard1of4", "group29-shard2of4", "group29-shard3of4", "group29-shard4of4"], "weights": [{"shape": [3, 3, 1536, 1], "name": "block14_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 1536, 2048], "name": "block14_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group30-shard1of1"], "weights": [{"shape": [2048], "name": "block14_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [2048], "name": "block14_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [2048], "name": "block14_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [2048], "name": "block14_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group31-shard1of1"], "weights": [{"shape": [3, 3, 3, 32], "name": "block1_conv1/kernel", "dtype": "float32"}]}, {"paths": ["group32-shard1of1"], "weights": [{"shape": [32], "name": "block1_conv1_bn/gamma", "dtype": "float32"}, {"shape": [32], "name": "block1_conv1_bn/beta", "dtype": "float32"}, {"shape": [32], "name": "block1_conv1_bn/moving_mean", "dtype": "float32"}, {"shape": [32], "name": "block1_conv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group33-shard1of1"], "weights": [{"shape": [3, 3, 32, 64], "name": "block1_conv2/kernel", "dtype": "float32"}]}, {"paths": ["group34-shard1of1"], "weights": [{"shape": [64], "name": "block1_conv2_bn/gamma", "dtype": "float32"}, {"shape": [64], "name": "block1_conv2_bn/beta", "dtype": "float32"}, {"shape": [64], "name": "block1_conv2_bn/moving_mean", "dtype": "float32"}, {"shape": [64], "name": "block1_conv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group35-shard1of1"], "weights": [{"shape": [3, 3, 64, 1], "name": "block2_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 64, 128], "name": "block2_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group36-shard1of1"], "weights": [{"shape": [128], "name": "block2_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group37-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "block2_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 128, 128], "name": "block2_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group38-shard1of1"], "weights": [{"shape": [128], "name": "block2_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [128], "name": "block2_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group39-shard1of1"], "weights": [{"shape": [3, 3, 128, 1], "name": "block3_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 128, 256], "name": "block3_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group40-shard1of1"], "weights": [{"shape": [256], "name": "block3_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group41-shard1of1"], "weights": [{"shape": [3, 3, 256, 1], "name": "block3_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 256, 256], "name": "block3_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group42-shard1of1"], "weights": [{"shape": [256], "name": "block3_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [256], "name": "block3_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group43-shard1of1"], "weights": [{"shape": [3, 3, 256, 1], "name": "block4_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 256, 728], "name": "block4_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group44-shard1of1"], "weights": [{"shape": [728], "name": "block4_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group45-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block4_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block4_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group46-shard1of1"], "weights": [{"shape": [728], "name": "block4_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block4_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group47-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block5_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block5_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group48-shard1of1"], "weights": [{"shape": [728], "name": "block5_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group49-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block5_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block5_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group50-shard1of1"], "weights": [{"shape": [728], "name": "block5_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group51-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block5_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block5_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group52-shard1of1"], "weights": [{"shape": [728], "name": "block5_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block5_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group53-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block6_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block6_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group54-shard1of1"], "weights": [{"shape": [728], "name": "block6_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group55-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block6_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block6_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group56-shard1of1"], "weights": [{"shape": [728], "name": "block6_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group57-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block6_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block6_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group58-shard1of1"], "weights": [{"shape": [728], "name": "block6_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block6_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group59-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block7_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block7_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group60-shard1of1"], "weights": [{"shape": [728], "name": "block7_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group61-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block7_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block7_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group62-shard1of1"], "weights": [{"shape": [728], "name": "block7_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group63-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block7_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block7_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group64-shard1of1"], "weights": [{"shape": [728], "name": "block7_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block7_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group65-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block8_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block8_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group66-shard1of1"], "weights": [{"shape": [728], "name": "block8_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group67-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block8_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block8_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group68-shard1of1"], "weights": [{"shape": [728], "name": "block8_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group69-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block8_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block8_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group70-shard1of1"], "weights": [{"shape": [728], "name": "block8_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block8_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group71-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block9_sepconv1/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block9_sepconv1/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group72-shard1of1"], "weights": [{"shape": [728], "name": "block9_sepconv1_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv1_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv1_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv1_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group73-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block9_sepconv2/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block9_sepconv2/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group74-shard1of1"], "weights": [{"shape": [728], "name": "block9_sepconv2_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv2_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv2_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv2_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group75-shard1of1"], "weights": [{"shape": [3, 3, 728, 1], "name": "block9_sepconv3/depthwise_kernel", "dtype": "float32"}, {"shape": [1, 1, 728, 728], "name": "block9_sepconv3/pointwise_kernel", "dtype": "float32"}]}, {"paths": ["group76-shard1of1"], "weights": [{"shape": [728], "name": "block9_sepconv3_bn/gamma", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv3_bn/beta", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv3_bn/moving_mean", "dtype": "float32"}, {"shape": [728], "name": "block9_sepconv3_bn/moving_variance", "dtype": "float32"}]}, {"paths": ["group77-shard1of1"], "weights": [{"shape": [1, 1, 64, 128], "name": "conv2d_1/kernel", "dtype": "float32"}]}, {"paths": ["group78-shard1of1"], "weights": [{"shape": [1, 1, 128, 256], "name": "conv2d_2/kernel", "dtype": "float32"}]}, {"paths": ["group79-shard1of1"], "weights": [{"shape": [1, 1, 256, 728], "name": "conv2d_3/kernel", "dtype": "float32"}]}, {"paths": ["group80-shard1of1"], "weights": [{"shape": [1, 1, 728, 1024], "name": "conv2d_4/kernel", "dtype": "float32"}]}, {"paths": ["group81-shard1of2", "group81-shard2of2"], "weights": [{"shape": [2048, 1000], "name": "predictions/kernel", "dtype": "float32"}, {"shape": [1000], "name": "predictions/bias", "dtype": "float32"}]}], "modelTopology": {"keras_version": "2.1.4", "model_config": {"class_name": "Model", "config": {"layers": [{"config": {"batch_input_shape": [null, null, null, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "name": "input_1", "inbound_nodes": [], "class_name": "InputLayer"}, {"config": {"use_bias": false, "strides": [2, 2], "name": "block1_conv1", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 32}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block1_conv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block1_conv1_bn", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block1_conv1_act", "trainable": true}, "name": "block1_conv1_act", "inbound_nodes": [[["block1_conv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"use_bias": false, "strides": [1, 1], "name": "block1_conv2", "trainable": true, "kernel_size": [3, 3], "activation": "linear", "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 64}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1_act", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block1_conv2_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block1_conv2_bn", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block1_conv2_act", "trainable": true}, "name": "block1_conv2_act", "inbound_nodes": [[["block1_conv2_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block2_sepconv1", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 128}, "name": "block2_sepconv1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block2_sepconv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block2_sepconv1_bn", "inbound_nodes": [[["block2_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block2_sepconv2_act", "trainable": true}, "name": "block2_sepconv2_act", "inbound_nodes": [[["block2_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block2_sepconv2", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 128}, "name": "block2_sepconv2", "inbound_nodes": [[["block2_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block2_sepconv2_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block2_sepconv2_bn", "inbound_nodes": [[["block2_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": false, "strides": [2, 2], "name": "conv2d_1", "trainable": true, "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 128}, "name": "conv2d_1", "inbound_nodes": [[["block1_conv2_act", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block2_pool", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "name": "block2_pool", "inbound_nodes": [[["block2_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_constraint": null, "name": "batch_normalization_1", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"name": "add_1", "trainable": true}, "name": "add_1", "inbound_nodes": [[["block2_pool", 0, 0, {}], ["batch_normalization_1", 0, 0, {}]]], "class_name": "Add"}, {"config": {"activation": "relu", "name": "block3_sepconv1_act", "trainable": true}, "name": "block3_sepconv1_act", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block3_sepconv1", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 256}, "name": "block3_sepconv1", "inbound_nodes": [[["block3_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block3_sepconv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block3_sepconv1_bn", "inbound_nodes": [[["block3_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block3_sepconv2_act", "trainable": true}, "name": "block3_sepconv2_act", "inbound_nodes": [[["block3_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block3_sepconv2", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 256}, "name": "block3_sepconv2", "inbound_nodes": [[["block3_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block3_sepconv2_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block3_sepconv2_bn", "inbound_nodes": [[["block3_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": false, "strides": [2, 2], "name": "conv2d_2", "trainable": true, "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 256}, "name": "conv2d_2", "inbound_nodes": [[["add_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block3_pool", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "name": "block3_pool", "inbound_nodes": [[["block3_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_constraint": null, "name": "batch_normalization_2", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"name": "add_2", "trainable": true}, "name": "add_2", "inbound_nodes": [[["block3_pool", 0, 0, {}], ["batch_normalization_2", 0, 0, {}]]], "class_name": "Add"}, {"config": {"activation": "relu", "name": "block4_sepconv1_act", "trainable": true}, "name": "block4_sepconv1_act", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block4_sepconv1", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block4_sepconv1", "inbound_nodes": [[["block4_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block4_sepconv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block4_sepconv1_bn", "inbound_nodes": [[["block4_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block4_sepconv2_act", "trainable": true}, "name": "block4_sepconv2_act", "inbound_nodes": [[["block4_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block4_sepconv2", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block4_sepconv2", "inbound_nodes": [[["block4_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block4_sepconv2_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block4_sepconv2_bn", "inbound_nodes": [[["block4_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"use_bias": false, "strides": [2, 2], "name": "conv2d_3", "trainable": true, "kernel_size": [1, 1], "activation": "linear", "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "data_format": "channels_last", "filters": 728}, "name": "conv2d_3", "inbound_nodes": [[["add_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "name": "block4_pool", "trainable": true, "pool_size": [3, 3], "data_format": "channels_last", "padding": "same"}, "name": "block4_pool", "inbound_nodes": [[["block4_sepconv2_bn", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"config": {"center": true, "beta_constraint": null, "name": "batch_normalization_3", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"name": "add_3", "trainable": true}, "name": "add_3", "inbound_nodes": [[["block4_pool", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "class_name": "Add"}, {"config": {"activation": "relu", "name": "block5_sepconv1_act", "trainable": true}, "name": "block5_sepconv1_act", "inbound_nodes": [[["add_3", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block5_sepconv1", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block5_sepconv1", "inbound_nodes": [[["block5_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block5_sepconv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block5_sepconv1_bn", "inbound_nodes": [[["block5_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block5_sepconv2_act", "trainable": true}, "name": "block5_sepconv2_act", "inbound_nodes": [[["block5_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block5_sepconv2", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block5_sepconv2", "inbound_nodes": [[["block5_sepconv2_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block5_sepconv2_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block5_sepconv2_bn", "inbound_nodes": [[["block5_sepconv2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block5_sepconv3_act", "trainable": true}, "name": "block5_sepconv3_act", "inbound_nodes": [[["block5_sepconv2_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block5_sepconv3", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block5_sepconv3", "inbound_nodes": [[["block5_sepconv3_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block5_sepconv3_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block5_sepconv3_bn", "inbound_nodes": [[["block5_sepconv3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"name": "add_4", "trainable": true}, "name": "add_4", "inbound_nodes": [[["block5_sepconv3_bn", 0, 0, {}], ["add_3", 0, 0, {}]]], "class_name": "Add"}, {"config": {"activation": "relu", "name": "block6_sepconv1_act", "trainable": true}, "name": "block6_sepconv1_act", "inbound_nodes": [[["add_4", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block6_sepconv1", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "filters": 728}, "name": "block6_sepconv1", "inbound_nodes": [[["block6_sepconv1_act", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"config": {"center": true, "beta_constraint": null, "name": "block6_sepconv1_bn", "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "gamma_constraint": null}, "name": "block6_sepconv1_bn", "inbound_nodes": [[["block6_sepconv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "name": "block6_sepconv2_act", "trainable": true}, "name": "block6_sepconv2_act", "inbound_nodes": [[["block6_sepconv1_bn", 0, 0, {}]]], "class_name": "Activation"}, {"config": {"activation": "linear", "pointwise_regularizer": null, "name": "block6_sepconv2", "depthwise_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "depth_multiplier": 1, "depthwise_constraint": null, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "kernel_size": [3, 3], "depthwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "use_bias": false, "pointwise_constraint": null, "pointwise_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": 